import pandas as pd
import pandas as pd

#--------------------変数------------------------------
colums_in = ["pk_1","pk_2","pk_3","pk_4","pk_5"]
colums_out = ["name","kata","mochimono"]
df_in = pd.DataFrame(columns=colums_in)
df_out = pd.DataFrame(columns=colums_out)
# print(df_in)
df_toku = pd.DataFrame()
df_ans = pd.DataFrame()

#------------------新しいデータをデータフレームに格納------------
def pkin(Data_in,Data_out):
    global df_in,df_out,colums_in,colums_out
    df_in_new = pd.Series(data=Data_in,index=colums_in)
    df_out_new = pd.Series(data=Data_out,index=colums_out)
    # print(df_in_new)
    df_in = pd.concat([df_in,df_in_new.to_frame().T])
    df_out = pd.concat([df_out,df_out_new.to_frame().T])
    # print(df_out)

#-----------------------初期データ--------------------------------------
pkin(["ガチグマ(暁)","パオジアン","ハバタクカミ","ウーラオス(水)","キラフロル"],["カイリュー","AS","いかさまダイス"])
pkin(["ブリジュラス","オーガポン(岩)","ハバタクカミ","ウーラオス(水)","イーユイ"],["カイリュー","AS","いかさまダイス"])
pkin(["キョジオーン","オーガポン(水)","ハバタクカミ","パオジアン","イーユイ"],["カイリュー","HAS","クリアチャーム"])
pkin(["ディンルー","サーフゴー","ハバタクカミ","パオジアン","ウーラオス(水)"],["カイリュー","HB","ゴツゴツメット"])
pkin(["ガチグマ(暁)","モロバレル","ハバタクカミ","ウーラオス(水)","イーユイ"],["カイリュー","AS","いかさまダイス"])
pkin(["タケルライコ","ミミッキュ","ハッサム","テツノツツミ","ランドロス"],["カイリュー","HAS","こだわりハチマキ"])
pkin(["パオジアン","ウーラオス(水)","ガチグマ(暁)","オーガポン(火)","ハバタクカミ"],["カイリュー","HB","ゴツゴツメット"])
pkin(["キョジオーン","ウーラオス(水)","ガチグマ(暁)","パオジアン","ハバタクカミ"],["カイリュー","HB","ゴツゴツメット"])
pkin(["パオジアン","ウーラオス(水)","ガチグマ(暁)","オーガポン(火)","ハバタクカミ"],["カイリュー","HA","ゴツゴツメット"])
pkin(["パオジアン","ウーラオス(水)","ガチグマ(暁)","オーガポン(火)","ハバタクカミ"],["カイリュー","HB","ゴツゴツメット"])
pkin(["イーユイ","ウーラオス(水)","ママンボウ","モロバレル","ブリジュラス"],["カイリュー","HA","こだわりハチマキ"])
pkin(["チオンジェン","イーユイ","ハバタクカミ","ウーラオス(水)","キラフロル"],["カイリュー","HA","とつげきチョッキ"])
pkin(["ブリジュラス","ブリムオン","イダイトウ(オス)","パオジアン","ガチグマ(暁)"],["カイリュー","HA","こだわりハチマキ"])
pkin(["キノガッサ","ミミッキュ","ハバタクカミ","ブリジュラス","イーユイ"],["カイリュー","HA","厚底ブーツ"])
pkin(["ディンルー","サーフゴー","ハバタクカミ","パオジアン","ウーラオス(水)"],["カイリュー","HB","ゴツゴツメット"])
pkin(["イーユイ","テツノツツミ","ミミッキュ","カバルドン","サーフゴー"],["カイリュー","AS","いかさまダイス"])
pkin(["ディンルー","サーフゴー","ハバタクカミ","パオジアン","ウーラオス(水)"],["カイリュー","HA","弱点保険"])
pkin(["ブリジュラス","ウーラオス(水)","ガチグマ(暁)","オーガポン(火)","ハバタクカミ"],["カイリュー","HA","厚底ブーツ"])
pkin(["キョジオーン","オーガポン(水)","ガチグマ(暁)","パオジアン","ハバタクカミ"],["カイリュー","AS","いかさまダイス"])
pkin(["パオジアン","ウーラオス(水)","ガチグマ(暁)","オーガポン(火)","ハバタクカミ"],["カイリュー","AS","厚底ブーツ"])
pkin(["イーユイ","ウーラオス(水)","ガチグマ(暁)","モロバレル","ハバタクカミ"],["カイリュー","AS","いかさまダイス"])
pkin(["ディンルー","ウーラオス(水)","サーフゴー","パオジアン","ハバタクカミ"],["カイリュー","HA","弱点保険"])

df_in.to_csv('learn_data/pk_data.csv')
df_out.to_csv('learn_data/Drago_data.csv')